src/cf/Catalogs/вогТипыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>вогТипыЗадач</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТипыПредметов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипПредмета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.вогТипыПредметовПоручений</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПредметаСтрокой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/вогТипыЗадач/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокВыбораТипыПредметов();
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТипыПредметов

&НаКлиенте
Процедура ТипыПредметовТипПредметаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТипыПредметов.ТекущиеДанные;
	ТекущиеДанные.ТипПредметаСтрокой = Строка(ТипЗнч(ТекущиеДанные.ТипПредмета));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокВыбораТипыПредметов() 
	
	Элементы.ТипыПредметовТипПредмета.СписокВыбора.Добавить(Неопределено, "Не указано");
	
	Для Каждого ТипПредмета Из Метаданные.ОпределяемыеТипы.вогТипыПредметовПоручений.Тип.Типы() Цикл 
		
		МассивТипов 	= Новый Массив;
		МассивТипов.Добавить(ТипПредмета);
		
		Описание 		= Новый ОписаниеТипов(МассивТипов);
		ПустаяСсылка 	= Описание.ПривестиЗначение(Неопределено);
		
		Элементы.ТипыПредметовТипПредмета.СписокВыбора.Добавить(ПустаяСсылка, СокрЛП(ТипПредмета));
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Для Каждого ЭлементСпискаВыбора Из Элементы.ТипыПредметовТипПредмета.СписокВыбора Цикл
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТипыПредметовТипПредмета.Имя);
		
		ЭлементУсловия = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элементы.ТипыПредметовТипПредмета.ПутьКДанным);
		ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементУсловия.ПравоеЗначение = ЭлементСпискаВыбора.Значение;
		
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", ЭлементСпискаВыбора.Представление);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
